c5/src/ChartsOfCharacteristicTypes/Settings/Settings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>Settings</name>
  <type>
    <types>ChartOfAccountsRef.General</types>
    <types>Boolean</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <types>CatalogRef.VAT</types>
    <types>CatalogRef.Insurance</types>
    <types>EnumRef.FuelExpenseMethods</types>
    <numberQualifiers>
      <precision>15</precision>
      <scale>2</scale>
    </numberQualifiers>
    <stringQualifiers>
      <length>150</length>
    </stringQualifiers>
    <dateQualifiers>
      <dateFractions>Date</dateFractions>
    </dateQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ClosingAdvances</name>
      <description>Closing Advances</description>
      <code>000000108</code>
    </items>
    <items>
      <name>Employees</name>
      <description>Employees</description>
      <code>000000001</code>
    </items>
    <items>
      <name>Insurance</name>
      <description>Insurance</description>
      <code>000000101</code>
    </items>
    <items>
      <name>LVI</name>
      <description>LVI</description>
      <code>000000119</code>
    </items>
    <items>
      <name>SickLeaves</name>
      <description>Sick Leaves</description>
      <code>000000132</code>
    </items>
    <items>
      <name>Waybill</name>
      <description>Waybill</description>
      <code>000000128</code>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

c5/src/InformationRegisters/Settings/Settings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Settings</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Value</name>
    <type>
      <types>Characteristic.Settings</types>
    </type>
  </resources>
  <dimensions>
    <name>Parameter</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.Settings</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/ChartsOfCharacteristicTypes/Settings/Forms/Setup/Module.bsl
&AtClient
var TableRow;

// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	loadParams ();
	setTitle ();
	filterHistory ();
	
EndProcedure

&AtServer
Procedure loadParams ()
	
	SetupDate = Parameters.SetupDate;
	Value = Parameters.Parameter.ValueType.AdjustValue ();
	
EndProcedure

&AtServer
Procedure setTitle ()
	
	Title = Parameters.Parameter;
	
EndProcedure 

&AtServer
Procedure filterHistory ()
	
	DC.SetFilter ( History, "Parameter", Parameters.Parameter );
	
EndProcedure 

// *****************************************
// *********** Group Form

&AtClient
Procedure OK ( Command )
	
	if ( CheckFilling () ) then
		save ();
		NotifyChanged ( Parameters.Parameter );
		Close ();
	endif; 
	
EndProcedure

&AtServer
Procedure save ()
	
	r = InformationRegisters.Settings.CreateRecordManager ();
	r.Parameter = Parameters.Parameter;
	r.Period = SetupDate;
	r.Value = Value;
	r.Write ();
	
EndProcedure 

&AtClient
Procedure SetupDateOnChange ( Item )
	
	adjustDate ();
	
EndProcedure

&AtClient
Procedure adjustDate ()
	
	if ( SetupDate = Date ( 1, 1, 1 ) ) then
		SetupDate = BegOfYear ( SessionDate () );
	else
		SetupDate = BegOfMonth ( SetupDate );
	endif; 
	
EndProcedure 

// *****************************************
// *********** Table History

&AtClient
Procedure HistoryOnActivateRow ( Item )
	
	TableRow = Item.CurrentData;
	loadRecord ();
	
EndProcedure

&AtClient
Procedure loadRecord ()
	
	if ( TableRow = undefined ) then
		return;
	endif; 
	Value = TableRow.Value;
	SetupDate = TableRow.Period;
	
EndProcedure 

&AtClient
Procedure HistoryBeforeAddRow ( Item, Cancel, Clone, Parent, Folder, Parameter )
	
	Cancel = true;
	
EndProcedure

&AtClient
Procedure HistoryBeforeRowChange ( Item, Cancel)
	
	Cancel = true;
	
EndProcedure
